# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)


    # Improved Domain Classifier with 3 feature maps
  - [4, 1, GradReversal, [1]] # 22 Gradient Reversal Layer    # 22
  - [-1, 1, Conv_BN, [64]] # 23                               # 23
  - [-1, 1, MaxPool, [20]] # 24                               # 24
  - [6, 1, GradReversal, [1]] # 25 Gradient Reversal Layer    # 25
  - [-1, 1, Conv_BN, [128]] # 26                              # 26
  - [-1, 1, MaxPool, [20]] # 27                               # 27
  - [-1, 1, Conv_BN, [64]] # 28                               # 28
  - [[-1, 24], 1, Concat, [1]] # 29                           # 29
  - [-1, 1, Conv_BN, [32]] # 30                               # 28
  - [-1, 1, MaxPool, [10]] # 31                               # 30

  - [9, 1, GradReversal, [1]] # 32 Gradient Reversal Layer
  - [-1, 1, Conv_BN, [256]] # 33
  - [-1, 1, Conv_BN, [128]] # 34
  - [-1, 1, MaxPool, [10]] # 35
  - [-1, 1, Conv_BN, [64]] # 36
  - [-1, 1, Conv_BN, [32]] # 37
  - [[-1, 31], 1, Concat, [1]] # 38
  - [-1, 1, Conv_BN, [32]] # 39
  - [-1, 1, MaxPool, [5]]
  - [-1, 1, Conv_BN, [16]] # 40
  - [-1, 1, Conv_BN, [1]] # 41
  - [-1, 1, AdaptiveAvgPooling, [1]] # 42 Adaptive Average Pooling layer



  # Domain classifier
  # DA1 on s feature map
  - [4, 1, GradReversal, [1]] # 42 Gradient Reversal Layer                # 22
  - [-1, 1, Conv_, [64, 32]] # 43                                         # 23
  - [-1, 1, AdaptiveAvgPooling, [1]] # 44 Adaptive Average Pooling layer  # 24
  # DA2 on m feature map
  - [6, 1, GradReversal, [1]] # 45 Gradient Reversal Layer                # 25
  - [-1, 1, Conv_, [128, 64]] # 46                                        # 26
  - [-1, 1, AdaptiveAvgPooling, [1]] # 47 Adaptive Average Pooling layer  # 27
  # DA3 on l feature map  
  - [9, 1, GradReversal, [1]] # 48 Gradient Reversal Layer                # 28
  - [-1, 1, Conv_, [256, 128]] # 49                                       # 29
  - [-1, 1, AdaptiveAvgPooling, [1]] # 50 Adaptive Average Pooling layer  # 30


  # Get unspacial features for features loss distance metric
  - [9, 1, AvgPooling, [1]] # 51                                          # 22
  

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
